s-expressions-as-a-lightweight-serialization-format.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2017-03-04 Sat 00:18 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>S-expressions as a Lightweight Serialization Format</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Bryan Garza">
<meta name="description" content="How to use sexprs for inter-process communication"
>
<meta name="keywords" content="s-expressions, sexprs, lisp, ocaml, ipc, serialization">

<link href="https://fonts.googleapis.com/css?family=Source+Code+Pro" rel="stylesheet" type="text/css">
<link href="./css/styles2.css" rel="stylesheet">
<link rel="stylesheet" type="text/css" href="./css/styles.css"/>
</head>
<body>
<div id="preamble" class="status">
<h1 class="title"><a href="http://bryangarza.github.io">Bryan Garza</a></h1>
</div>
<div id="content">
<p>
<div class="outline-3"><h3><a href="./s-expressions-as-a-lightweight-serialization-format.html"> S-expressions as a Lightweight Serialization Format</a><span> </span><span class="timestamp-wrapper"><span class="timestamp">( February 17, 2016)</span></span></h3>
</p>

<p>
I&rsquo;ve been writing a desktop application that uses OCaml for the backend, and
Racket for the GUI frontend. To communicate between the two, I call the OCaml
program as a subprocess from Racket, and have s-expressions be the serialization
mechanism that both languages can understand. Jane Street&rsquo;s <a href="https://github.com/janestreet/core">Core</a>, along with the
<code>sexplib</code> syntax extension mentioned in my previous post, offer an easy way to
translate OCaml types to sexps that Racket can then read.
</p>

<p>
With a type like:
</p>
<div class="org-src-container">
<pre class="src src-ocaml"><span class="org-tuareg-font-lock-governing">type</span> <span class="org-type">book</span> <span class="org-tuareg-font-lock-operator">=</span> <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-1">{</span></span>
  title        <span class="org-tuareg-font-lock-operator">:</span> string<span class="org-tuareg-font-lock-operator">;</span>
  authors      <span class="org-tuareg-font-lock-operator">:</span> string list<span class="org-tuareg-font-lock-operator">;</span>
  pubdate      <span class="org-tuareg-font-lock-operator">:</span> string<span class="org-tuareg-font-lock-operator">;</span>
  publishers   <span class="org-tuareg-font-lock-operator">:</span> string list<span class="org-tuareg-font-lock-operator">;</span>
  subjects     <span class="org-tuareg-font-lock-operator">:</span> string list
<span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-1">}</span></span> <span class="org-keyword">with</span> sexp
</pre>
</div>

<p>
A <code>sexp_of_book</code> function is automatically generated.
</p>

<p>
Now racket can receive:
</p>
<div class="org-src-container">
<pre class="src src-scheme">'<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-rainbow-delimiters-depth-2">(</span>title <span class="org-string">"Purely functional data structures"</span><span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>authors <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-string">"Chris Okasaki"</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>pubdate 1999<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>publishers <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-string">"Cambridge University Press"</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>subjects <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-string">"Functional programming languages"</span> <span class="org-string">"Data structures (Computer science)"</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
I take this sexp, and create a <code>book</code> struct:
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span class="org-rainbow-delimiters-depth-1">(</span>struct book <span class="org-rainbow-delimiters-depth-2">(</span>title authors pubdate publishers subjects<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">define</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-function-name">isbn-lookup</span> isbn<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">let</span> <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-rainbow-delimiters-depth-4">[</span>cmd <span class="org-rainbow-delimiters-depth-5">(</span>string-join <span class="org-rainbow-delimiters-depth-6">(</span>list homelib-binary isbn<span class="org-rainbow-delimiters-depth-6">)</span><span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">]</span><span class="org-rainbow-delimiters-depth-3">)</span>
    <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-rainbow-delimiters-depth-4">(</span><span class="org-keyword">&#955;</span>~&gt;&gt; process    <span class="org-comment-delimiter">; </span><span class="org-comment">-&gt; '(stdout stdin proc-id stderr f)</span>
           car
           read       <span class="org-comment-delimiter">; </span><span class="org-comment">from an input port</span>
           <span class="org-rainbow-delimiters-depth-5">(</span><span class="org-keyword">map</span> cadr<span class="org-rainbow-delimiters-depth-5">)</span> <span class="org-comment-delimiter">; </span><span class="org-comment">(k v) -&gt; v</span>
           <span class="org-rainbow-delimiters-depth-5">(</span>apply book<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
     cmd<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Finally, we can test it out on the REPL to make sure it works:
</p>
<div class="org-src-container">
<pre class="src src-scheme">racket@app.rkt&gt; <span class="org-rainbow-delimiters-depth-1">(</span>isbn-lookup <span class="org-string">"0521663504"</span><span class="org-rainbow-delimiters-depth-1">)</span>
#&lt;book&gt;

racket@app.rkt&gt; <span class="org-rainbow-delimiters-depth-1">(</span>book-title <span class="org-rainbow-delimiters-depth-2">(</span>isbn-lookup <span class="org-string">"0521663504"</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-string">"Purely functional data structures"</span>

racket@app.rkt&gt; <span class="org-rainbow-delimiters-depth-1">(</span>book-subjects <span class="org-rainbow-delimiters-depth-2">(</span>isbn-lookup <span class="org-string">"0521663504"</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
'<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"Functional programming languages"</span> <span class="org-string">"Data structures (Computer science)"</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Similarly, I can work in the other direction, and pass Racket s-expressions to
OCaml, and using sexplib, convert them back to OCaml types. What a time to be
alive!
</p>

<p>
</div>
</p>
</div>
<div id="postamble" class="status">
<a href="archive.html">Archive</a>
</div>
</body>
</html>
